app/controllers/books_controller.rb

def index
    if params[:search]
      @books = Book.search(params[:search]).paginate(:page => params[:page], :per_page => 4)
---
SELECT "books".* FROM "books" WHERE (title like '%potop%') LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "books" WHERE (title like '%m%')

  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save
---
INSERT INTO "books" ("author", "cover", "created_at", "isbn", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["author", "d"], ["cover", "untitled.png"], ["created_at", Fri, 21 Mar 2014 08:07:14 UTC +00:00], ["isbn", ""], ["title", ""], ["updated_at", Fri, 21 Mar 2014 08:07:14 UTC +00:00]]

  def update
    respond_to do |format|
      if @book.update(book_params)
---
UPDATE "books" SET "author" = ?, "updated_at" = ? WHERE "books"."id" = 1  [["author", "Henryk Sienkiewiczwewe"], ["updated_at", Fri, 16 May 2014 11:34:34 UTC +00:00]]